{"id":4918,"user_name":"islandrockin","user_profile":"https://www.tripadvisor.ca/Profile/islandrockin","user_rating":4,"user_review":"Good place in Bamfield Unit was clean,the property overall presents well.The owners Don & Dianne are great hosts.Only one of the units has a view though,but the units themselves are clean and have good furnishings all the utensils needed and good linens. Satellite Flatscreen TV and WiFi  Good location', '…","user_reviewdate":"Mar. 2015","user_staydate":" March 2015","att_id":3653,"user_id":91}
{"id":315,"user_name":"Nancy L","user_profile":"https://www.tripadvisor.ca/Profile/nancylG8212WE","user_rating":5,"user_review":"Remote Beauty, First Class Treatment  This little lodge overlooking the Kispiox River is surrounded by natural beauty. With only 8 guestrooms, service is indeed individual. The friendly and courteous staff greeted us by name, noted our preferences and catered to our needs. Gourmet food was prepared with food', '…","user_reviewdate":"Aug. 2018","user_staydate":" August 2018","att_id":233,"user_id":1}
{"id":2950,"user_name":"Alek S","user_profile":"https://www.tripadvisor.ca/Profile/aleks958","user_rating":5,"user_review":"The view is great, Owners are very nice, view is great, room is not expensive, clean, very quiet place. It is small but they provide everything you need. Each cabin has a grill next to it. You will wake up with a sound of ocean","user_reviewdate":"Aug. 2018","user_staydate":" July 2018","att_id":2164,"user_id":34}
{"id":5008,"user_name":"LeNord-Cotier","user_profile":"https://www.tripadvisor.ca/Profile/LeNord-Cotier","user_rating":2,"user_review":"Pour le prix, c'est correct ! Les points positifs :  - La localisation est très agréable, au coeur de la ville et face au Lac-St-Jean ; - Le prix est idéal en voyage budget (autour de 50 $ pour une chambre) ; - La grandeur de la chambre (située dans le pavillon face au Lac) est adéquate.  Les points négatifs', '…","user_reviewdate":"Jan. 2012","user_staydate":" September 2011","att_id":3716,"user_id":25}
{"id":2597,"user_name":"John W","user_profile":"https://www.tripadvisor.ca/Profile/johnwW6062AZ","user_rating":5,"user_review":"Great Visit We were there in January and they offered a snowmobile package breakfast / dinner and accommodations.  Great food clean comfortable room.  Not to far off the trails but because we were coming in after dark (sunset 1600 hrs) better signage would have helped.  Make sure you fill', '…","user_reviewdate":"Mar. 2018","user_staydate":" January 2018","att_id":1892,"user_id":10}
{"id":6033,"user_name":"Mark_S36669","user_profile":"https://www.tripadvisor.ca/Profile/Mark_S36669","user_rating":4,"user_review":"A Nice Stay Clean room with nice decor. It smelled a touch stale and, yes, as a previous reviewer noted, hte coffee maker was a little dirty. But no big deal. They have the regular motel rooms and also have the \"efficiency units\" with something more in the way of appliances such as stove', '…","user_reviewdate":"Apr. 2014","user_staydate":" April 2014","att_id":4399,"user_id":16}
{"id":5003,"user_name":"Tom B","user_profile":"https://www.tripadvisor.ca/Profile/tombH4399HE","user_rating":4,"user_review":"Lovely B&B with authentic homemade treats for breakfast The gite is located next to highway 138, but traffic didn' bother us.  Besides the regular croissants, slices of bread, there is a treat like bananabread or a brioche with orange for every guest.  The eggs are made to your choice and à la minute.  Coffee, tea or hot chocolate\", '…","user_reviewdate":"Nov. 2014","user_staydate":" July 2014","att_id":3712,"user_id":24}
{"id":4937,"user_name":"AnnaJHToronto","user_profile":"https://www.tripadvisor.ca/Profile/AnnaJHToronto","user_rating":5,"user_review":"Warm welcome in magical region Beautiful inn, restaurant and cultural centre in the heart of the island. Wonderful hosts, who’ve renovated this space with so much love. Very pretty rooms with private bathrooms and gorgeous views, extremely  comfortable beds, decorated with charm and creativity and local art.', '…","user_reviewdate":"Mar. 18","user_staydate":" March 2019","att_id":3669,"user_id":28}
{"id":4793,"user_name":"Redgreen542","user_profile":"https://www.tripadvisor.ca/Profile/Redgreen542","user_rating":5,"user_review":"Excellent Food and Value We went for the prime rib night and certainly were not disappointed.  The elk spring rolls were awesome!!  Then we had caesar salad prior to our prime rib.  Again top drawer!!  The prime rib was a HUGE portion complimented with mashed potatoes, gravy, fresh vegetables and', '…","user_reviewdate":"Nov. 2018","user_staydate":" November 2018","att_id":3559,"user_id":70}
{"id":1215,"user_name":"twoinmaine","user_profile":"https://www.tripadvisor.ca/Profile/twoinmaine","user_rating":3,"user_review":"Basic Lodging on North Side of Gros Morne Mrs. TwoInMaine loves the beach at Shallow Bay - the warm water, long sand beach, dunes, gentle lapping waves. The J&J B&B is two miles from the beach in the town of Cow Head. Shallow Bay Motel owns every lodging in town, and this a good one-night or two-night stay location. The', '…","user_reviewdate":"Feb. 2019","user_staydate":" August 2018","att_id":875,"user_id":0}
{"id":1383,"user_name":"deepa p","user_profile":"https://www.tripadvisor.ca/Profile/631deepap","user_rating":4,"user_review":"Super Vegetarian B&B Being a vegetarian & sensitive to meat/sea food smells, I was delighted to find this B&B which serves only vegetarian.   The hosts Richard & Sandrine were very hospitable and made us feel completely at ease. They were very helpful as well.  The room & bathroom was neat and', '…","user_reviewdate":"Sep. 2015","user_staydate":" August 2015","att_id":1008,"user_id":71}
{"id":4215,"user_name":"mickyrouten","user_profile":"https://www.tripadvisor.ca/Profile/mickyrouten","user_rating":4,"user_review":"Would have gotten only 3 circles This was a very basic, out-of--the way place, & I would probably only have given it a 3 rating, but the 3 or 4 front desk people we dealt with were especially pleasant. The room was clean, & there was adequate space.  It had a mini fridge (with a small freezer section), mini', '…","user_reviewdate":"Aug. 2018","user_staydate":" August 2018","att_id":3140,"user_id":62}
{"id":5723,"user_name":"Dallas M","user_profile":"https://www.tripadvisor.ca/Profile/dallasm417","user_rating":5,"user_review":"Very excellent management This place is amazing upon arrival. Well maintained place. Owner was very respectful and very understanding. Rooms are very well looked after with huge TVs. They respect your privacy and take time to drop off towels/coffee/etc. When staying for long periods.","user_reviewdate":"Mar. 25","user_staydate":" March 2019","att_id":4209,"user_id":32}
{"id":5423,"user_name":"dogpaw2016","user_profile":"https://www.tripadvisor.ca/Profile/dogpaw2016","user_rating":5,"user_review":"Quiet piece of Heaven Quiet, peaceful get away.  Beautiful resort cottages, well maintained.  Lots of fishing, boating, water is clean and beautiful, nice beach for swimming.  Camp fires at night, no sounds except nature saying hello stranger.","user_reviewdate":"Feb. 2019","user_staydate":" August 2018","att_id":4010,"user_id":67}
{"id":5708,"user_name":"Nicole G","user_profile":"https://www.tripadvisor.ca/Profile/nicolegX9379TL","user_rating":4,"user_review":"Charming The location is conveniently located near the hospital and the skating arena.   Modest, clean rooms with all the amenities you need (microwave, fridge and coffee pot).  Would recommend this place to friends.  Can't beat the price!  Love the idea of a community kitchen.","user_reviewdate":"Apr. 2017","user_staydate":" February 2017","att_id":4201,"user_id":49}
{"id":2375,"user_name":"christasmith","user_profile":"https://www.tripadvisor.ca/Profile/christasmith","user_rating":5,"user_review":"Charming and comfortable Wonderful time, excellent and generous breakfast! Good for guest with dietary restrictions, like gluten free and dairy free. Highly recommend, the hosts are friendly and helpful without being invasive :)","user_reviewdate":"Jun. 2018","user_staydate":" June 2018","att_id":1739,"user_id":87}
{"id":6073,"user_name":"Shawn D","user_profile":"https://www.tripadvisor.ca/Profile/330shawnd","user_rating":5,"user_review":"Private sites, Amazing ocean sunsets!! We stayed most of the week in our RV.  Very relaxing park.  Nice wooded sites, as well as some on the waterfront.  Plenty of spacious sites with 3 services.  Amazing sunsets by the beach.  A few km from the beautiful oceanfront bike/walking path.  Mosquitoes came out in the', '…","user_reviewdate":"Aug. 2018","user_staydate":" August 2018","att_id":4428,"user_id":79}
{"id":2978,"user_name":"Rosey009","user_profile":"https://www.tripadvisor.ca/Profile/Rosey009","user_rating":4,"user_review":"Comfortable & delicious B&B We stayed here for 2 nights so we would be close to Forillon Park to go hiking. It was an excellent location for us, right along the River. It was quiet and the room was large and comfortable with free wireless. The bed and breakfast is beautifully decorated with antiques. It's\", '…","user_reviewdate":"Aug. 2014","user_staydate":" July 2014","att_id":2179,"user_id":86}
{"id":835,"user_name":"Binky602013","user_profile":"https://www.tripadvisor.ca/Profile/Binky602013","user_rating":5,"user_review":"A Great Cottage! We stayed for a couple of nights this week. We had cottage #3. Very cute, cozy, had all amenities other than TV but had some CD’s and wifi is fast and efficient. The view was outstanding.  The weather was iffy the time we were there and we did not use the canoe, bicycles or fish', '…","user_reviewdate":"Sep. 2018","user_staydate":" September 2018","att_id":617,"user_id":7}
{"id":2595,"user_name":"Vaughn B","user_profile":"https://www.tripadvisor.ca/Profile/915vaughnb","user_rating":4,"user_review":"Excellent location! This is an OLD building. Make no mistake about it...... Rooms were CLEAN, and that gets top marks with us. Small kitchenette was a pleasant surprise, and enough to make some great meals. Only staples offered are salt/pepper, and coffee filters. Anything else, down to the store', '…","user_reviewdate":"Jul. 2017","user_staydate":" July 2017","att_id":1890,"user_id":56}
{"id":4548,"user_name":"Jenny A","user_profile":"https://www.tripadvisor.ca/Profile/91farmerwife","user_rating":5,"user_review":"Best B & B My husband and I were traveling in Alberta and had the opportunity of staying at the SpringBreak Flower Farm B and B in Crowsnest Pass. Our hosts Rick and Val were wonderful and Val made us an amazing breakfast. The best part was the location and spending time on their beautiful', '…","user_reviewdate":"Sep. 2018","user_staydate":" June 2018","att_id":3387,"user_id":8}
{"id":340,"user_name":"Nancy L","user_profile":"https://www.tripadvisor.ca/Profile/nancylG8212WE","user_rating":5,"user_review":"Remote Beauty, First Class Treatment  This little lodge overlooking the Kispiox River is surrounded by natural beauty. With only 8 guestrooms, service is indeed individual. The friendly and courteous staff greeted us by name, noted our preferences and catered to our needs. Gourmet food was prepared with food', '…","user_reviewdate":"Aug. 2018","user_staydate":" August 2018","att_id":244,"user_id":1}
{"id":2015,"user_name":"ENRIC-23","user_profile":"https://www.tripadvisor.ca/Profile/ENRIC-23","user_rating":1,"user_review":"Well-located in the middle of the nature. Surrounded by a beautiful nature near to the river. The \"Auberge\" is a bit far from Chicoutimi, it is necessary to go there by car. The building is nice and warm. When I arrived nobody was in the reception. Check the info before going there.","user_reviewdate":"Oct. 2016","user_staydate":" September 2016","att_id":1476,"user_id":44}
