{"id":2741,"user_name":"Dani U","user_profile":"https://www.tripadvisor.ca/Profile/daniellebelisle","user_rating":5,"user_review":"Excellence at a great price Quiet, secure, very clean, nicely decorated, great breakfast & hospitality.  Small drawback, you must share the bathroom but they had offered to use another one if the one next to the room was occupied. In compensation cozy bathrobes and slippers for walking around.  I do not', '…","user_reviewdate":"Oct. 2013","user_staydate":" October 2013","att_id":2005,"user_id":73}
{"id":4839,"user_name":"NZCass","user_profile":"https://www.tripadvisor.ca/Profile/NZCass","user_rating":5,"user_review":"Very impressive B&B Only spent 1 night here, as we were passing through on our way to Toronto. We had stayed at a number of B&B's in Quebec in the previous 2 weeks, but this one was exceptional. Not the location so much, as it is slightly out of town, but the room itself was great. It was modern,\", '…","user_reviewdate":"Aug. 2010","user_staydate":" August 2010","att_id":3591,"user_id":33}
{"id":5125,"user_name":"Kate P","user_profile":"https://www.tripadvisor.ca/Profile/53katep","user_rating":5,"user_review":"Very warm and wonderful Quebec experience My family and I had the good fortune to have a friend suggest we stay at le Vallon when we were skiing at Val St Come in Quebec.  We had no idea we would be welcomed into Therese's home, to experience true Quebec hospitality.  The rooms were fine, the countryside beautiful, and\", '…","user_reviewdate":"Dec. 2013","user_staydate":" December 2013","att_id":3797,"user_id":5}
{"id":2665,"user_name":"romboy68","user_profile":"https://www.tripadvisor.ca/Profile/romboy68","user_rating":5,"user_review":"Awesome place, awesome hospitality My wife & myself spent 2 nights here, separated by a 5 day trip to Mt Robson. From the moment we arrived the care and attention we received was amazing, both Bonnie and Paul went above & beyond to help us. This was our last night of comfort before going into the backcountry and', '…","user_reviewdate":"Aug. 2013","user_staydate":" August 2013","att_id":1944,"user_id":54}
{"id":5967,"user_name":"phat_dawg_21","user_profile":"https://www.tripadvisor.ca/Profile/phat_dawg_21","user_rating":1,"user_review":"My mistake Let me give you a tip: If you want to have a nice day, don’t try to shave while your wife is in the shower. My wife did not appreciate the sudden splash of cold water.  The bathroom was poorly lite, and the only outlet appeared to be on the underside of the 1940’s style light', '…","user_reviewdate":"Jul. 2017","user_staydate":" June 2017","att_id":4359,"user_id":20}
{"id":3427,"user_name":"PEI_Travellers","user_profile":"https://www.tripadvisor.ca/Profile/PEI_Travellers","user_rating":3,"user_review":"Did in a pinch. All big chain hotels in area were booked up.  One of the desk clerks recommended Auberge Motel Moka-Creme.  Room was clean, rate was decent.  Clerk spoke absolutely no English, so checking in was a very painful process.","user_reviewdate":"Jul. 2012","user_staydate":" July 2012","att_id":2477,"user_id":76}
{"id":3485,"user_name":"Nataliya M","user_profile":"https://www.tripadvisor.ca/Profile/464nataliyam","user_rating":5,"user_review":"Room on the corner We stayed in  the corner room over the restaurant. Room was not big but has 3 Windows looking in different directions. Open them and have a fresh breeze filling the room. A little noise from traffic but keep them open is your choice and not nessesery. Bed was comfortable. Few', '…","user_reviewdate":"Sep. 2016","user_staydate":" September 2016","att_id":2522,"user_id":4}
{"id":5098,"user_name":"Catherine D","user_profile":"https://www.tripadvisor.ca/Profile/CatherineD1860","user_rating":5,"user_review":"cosy accomodations with delicious 3-course breakfast We stayed at Gite La Marmotte for two days since we were visiting the zoo in Granby, about half an hour away. We rented the suite with a small room with sofa-bed. My five-year old was very happy to have her own space, which rarely happens when we travel. She slept very soundly.', '…","user_reviewdate":"Aug. 2018","user_staydate":" July 2018","att_id":3778,"user_id":18}
{"id":4643,"user_name":"Barb042","user_profile":"https://www.tripadvisor.ca/Profile/Barb042","user_rating":3,"user_review":"Motel Le Radisson De Val-David. If you had the airconditioner on, it was freezing and noisey. f If you turned it off and opened the windows, the noise from the road was deafening. The location is NOT good.  The beds were comfortable, however, and the staff was pleasant.  The price was good.  It's OK to pass\", '…","user_reviewdate":"Aug. 2013","user_staydate":" July 2013","att_id":3451,"user_id":74}
{"id":1625,"user_name":"sarahandkyle","user_profile":"https://www.tripadvisor.ca/Profile/sarahandkyle","user_rating":3,"user_review":"Decent but one thing ruined it Great location in Picton and charming, but unfortunately one thing ruined it for me and my husband. We were in the area for a wedding this past weekend and stayed at The Fenix for one night in the 68 lower room.  Positives: Great location and very handy that we were able to', '…","user_reviewdate":"May 2015","user_staydate":" May 2015","att_id":1166,"user_id":42}
{"id":3518,"user_name":"Dreamfox","user_profile":"https://www.tripadvisor.ca/Profile/Dreamfox","user_rating":5,"user_review":"cosy and clean with a 6 star breakfast! A real familial cosy atmosphere is given by the owner that definitely wants you to be happy and receive a nice “Bed & Breakfast” experience.  Being the only guest that night I was invited to visit / explore all the rooms and must say they are were all well arranged, painted', '…","user_reviewdate":"Dec. 2013","user_staydate":" November 2013","att_id":2536,"user_id":47}
{"id":2701,"user_name":"JyotiP1981","user_profile":"https://www.tripadvisor.ca/Profile/JyotiP1981","user_rating":5,"user_review":"Beautiful hotel & Excellent Service! From the moment we checked in, this place stole our heart! We were running late so checked in after midnight and the front desk was super sweet and courteous.   The room is perfect and the perfectly organized breakfast in the room is such a wonderful idea!  The housekeeping', '…","user_reviewdate":"Mar. 2","user_staydate":" March 2019","att_id":1970,"user_id":58}
{"id":3314,"user_name":"jdonn","user_profile":"https://www.tripadvisor.ca/Profile/jdonn","user_rating":5,"user_review":"Simple, comfortable chalet in a gorgeous setting.A real bargain! We spent three nights and wish we had planned many more. There are many beautiful sights and good restaurants in the area. The whale-watching is fantastic! The car ferry from Baie Sainte Catherine runs often, 24/7, and is free.       Although the chalet is in a wooded area, with', '…","user_reviewdate":"Aug. 2017","user_staydate":" August 2017","att_id":2403,"user_id":21}
{"id":1790,"user_name":"Larry H","user_profile":"https://www.tripadvisor.ca/Profile/larryhE3178JL","user_rating":3,"user_review":"Decent, but not for the mobility impaired We just returned from two nights there.  The only available rooms were on the third floor, which requires climbing 24 steps.  There was no grab bar in the bath room, so not recommended for the mobility impaired.  The first impression pulling in was that the place looked a bit', '…","user_reviewdate":"Aug. 2018","user_staydate":" August 2018","att_id":1312,"user_id":101}
{"id":2850,"user_name":"Rick M","user_profile":"https://www.tripadvisor.ca/Profile/rickmB5281UL","user_rating":5,"user_review":"Wonderful time in Tobermory We stayed at Cedar Grove Cottages Family Resort over the past weekend, and couldn't have been more pleased with our visit. We stayed in Cottage 1, the largest of all the cottages, and had 6 guys in the cabin (the weekend getaway was for a bachelor party).   The resort was about\", '…","user_reviewdate":"Sep. 2017","user_staydate":" September 2017","att_id":2087,"user_id":65}
{"id":4697,"user_name":"Maritimer37","user_profile":"https://www.tripadvisor.ca/Profile/Maritimer37","user_rating":5,"user_review":"Awesome Campground Wonderful campground with lots of big wooded sites.  Lots to do for kids and adults.  Water slides, nice pool and great playground. Great store and canteen A real nice pavillion for BBQ and music.  Very clean and well managed.","user_reviewdate":"Aug. 2014","user_staydate":" July 2014","att_id":3490,"user_id":38}
{"id":2366,"user_name":"Isabelle P","user_profile":"https://www.tripadvisor.ca/Profile/901isabellep","user_rating":3,"user_review":"Great service, good food, terrible decor At the Vieux Bicois, we shared good enough sangria, half a pulled pork pizza and half a bacon pizza. The pizzas were good and had generous toppings. Instead of pepperoni in the bacon pizza, you get even more bacon under the cheese. The waitress was everything a waitress should', '…","user_reviewdate":"Jul. 2016","user_staydate":" July 2016","att_id":1734,"user_id":78}
{"id":5093,"user_name":"Mina M","user_profile":"https://www.tripadvisor.ca/Profile/minamH7084VU","user_rating":4,"user_review":"GREAT All the thing was good in Hotel-Motel Coronet.The room was good with a nice balcony.  The staff was friendly and responsible. I missed my key there and they send immediately. It is a good choice for a stop-and-go.","user_reviewdate":"Sep. 2017","user_staydate":" August 2017","att_id":3773,"user_id":82}
{"id":5018,"user_name":"eseliv","user_profile":"https://www.tripadvisor.ca/Profile/eseliv","user_rating":3,"user_review":"not for me First of all I don't play golf. Booked this hotel only because I wanted a place on the shore and at the tip of Gaspésie to explore nearby towns and parks. For the people playing golf it might worth it, I would not stay there again any soon. Location proved to be not perfect but\", '…","user_reviewdate":"Aug. 2015","user_staydate":" August 2015","att_id":3721,"user_id":84}
{"id":2435,"user_name":"DKS","user_profile":"https://www.tripadvisor.ca/Profile/DKSYDK","user_rating":5,"user_review":"Clean room & great service First time visiting Campbell river. This cozy motel is located right by the ocean - amazing view. Room was very cleaned and well kept. We found owner was very accommodating and friendly. We felt very safe staying here. We will definitely stay here again when visiting Campbell', '…","user_reviewdate":"Feb. 2019","user_staydate":" February 2019","att_id":1776,"user_id":30}
{"id":3521,"user_name":"Grandma_Pig","user_profile":"https://www.tripadvisor.ca/Profile/Grandma_Pig","user_rating":4,"user_review":"No pets allowed - but owners have a poodle - otherwise great value I have severe allergies so I only go to places that have a no-pets policy.  I was surprised to find a poodle just outside the door of my room on arrival.  It seems that \"no pets\" just means no pets belonging to guests.  I hope the listing can be changed so it reflects the', '…","user_reviewdate":"Sep. 2014","user_staydate":" September 2014","att_id":2538,"user_id":100}
{"id":2010,"user_name":"glaciergirl3","user_profile":"https://www.tripadvisor.ca/Profile/glaciergirl3","user_rating":5,"user_review":"Sweet little B&B Our family of three stayed for one night en route from Vermont to the fiords because it was more reasonably priced than the hotels in Saguenay. The B&B is in a rural location but not difficult to find. Maud and Yvon are lovely hosts, and both speak English. Be sure to note check', '…","user_reviewdate":"Aug. 2014","user_staydate":" July 2014","att_id":1471,"user_id":59}
{"id":4376,"user_name":"Yorkie1948","user_profile":"https://www.tripadvisor.ca/Profile/Yorkie1948","user_rating":5,"user_review":"Great Stay I changed my plans to take in the Top of the World Highway so needed somewhere to stay in Dawson City and decided to stay here. I had one of the refurbished rooms (208) upstairs and it was great, everything i needed, Microwave, Fridge, Coffee Maker, Cable TV and good wi fi. Bed', '…","user_reviewdate":"Sep. 2018","user_staydate":" September 2018","att_id":3257,"user_id":51}
{"id":460,"user_name":"Bekah S","user_profile":"https://www.tripadvisor.ca/Profile/431bekahs","user_rating":5,"user_review":"Wonderful! Delicious breakfast, great location for Ironman Mont Tremblant (only 20 minutes south, very straight forward drive), very comfortable and very welcoming hosts. I would definitely recommend this to anyone during winter and summer months. Delightful hot tub and pool in back.","user_reviewdate":"Aug. 2015","user_staydate":" August 2015","att_id":332,"user_id":98}
{"id":4416,"user_name":"Noam S","user_profile":"https://www.tripadvisor.ca/Profile/Noam_Sh","user_rating":4,"user_review":"A nice stop on the way, good location I stayed with my family (2 adults, 3 year old, 5 month old baby) in one of the cottages for one night, on our way from New Brunswick to Toronto. The staff was very nice and helpful, the cottage cozy and nice, it's nothing fancy, but had everything we needed. The swimming pool\", '…","user_reviewdate":"Aug. 2018","user_staydate":" August 2018","att_id":3288,"user_id":94}
{"id":5698,"user_name":"PAUL L","user_profile":"https://www.tripadvisor.ca/Profile/451PaulL","user_rating":4,"user_review":"Plain, but Good Value Small motel - only about 15 rooms just off the main road.  This was a tough one to rate.  Based just on looks and frills, it would only get a 3.  But, all the basic amenities are there - A/C, micro., fridge, TV, good tub & shower and comfortable beds. Plus it's clean and costs\", '…","user_reviewdate":"Jun. 2018","user_staydate":" May 2018","att_id":4195,"user_id":72}
{"id":1815,"user_name":"SUZIE38","user_profile":"https://www.tripadvisor.ca/Profile/SUZIE38","user_rating":4,"user_review":"comfort Went there to attend an  academic meeting. It is a bed and breakfast, quiet tidy and close to eating places and downtown. Very comfortable. It is very close to Western Campus, with regular bus service to campus and downtown. Within walking distance to a pharmacy, subway, andv', '…","user_reviewdate":"Sep. 2015","user_staydate":" August 2015","att_id":1334,"user_id":3}
{"id":2964,"user_name":"Pat5150","user_profile":"https://www.tripadvisor.ca/Profile/Pat5150","user_rating":3,"user_review":"Great hostel, but poor vibe due to all the families and young children L'Auberge de Douglastown is a similar establishment to the hostel in a converted school located in Cap-aux-Os, near the Forillon national park. Both also serve as community centers, libraries, and multi-task venues for their respective towns.  Situated halfway between both\", '…","user_reviewdate":"Jul. 2018","user_staydate":" July 2018","att_id":2173,"user_id":63}
{"id":1308,"user_name":"Vancouverguy_10","user_profile":"https://www.tripadvisor.ca/Profile/Vancouverguy_10","user_rating":1,"user_review":"Very Poor Value Stayed here August 12, 2014. A very tired and down at heel motel. Carpet in room was badly stained, not suitable for bare feet. Room bore no resemblance to photos on motel's website. At $105 was terrible value. Equates to what currently goes for $35/night all over the USA. \", '…","user_reviewdate":"Aug. 2014","user_staydate":" August 2014","att_id":951,"user_id":45}
{"id":2013,"user_name":"peter z","user_profile":"https://www.tripadvisor.ca/Profile/peterz695","user_rating":5,"user_review":"Pleasant stay We would like to thank Christine for her hospitality and friendliness. Our stay at your beautiful and very clean home was very enjoyable. The breakfast was great, but the crepes, wow, now that is the way to start your day, thank you! we wish you and your family well and hope to', '…","user_reviewdate":"Sep. 2014","user_staydate":" August 2014","att_id":1474,"user_id":48}
{"id":6108,"user_name":"rmitric","user_profile":"https://www.tripadvisor.ca/Profile/rmitric","user_rating":1,"user_review":"Ridiculous service The customer assistant refused (August 1, 2018, 13:49 o’clock) my request to send me an e-mail in order to confirm that I have stayed there for one night (VERY SIMPLE CASE, I paid them -the Motel Bonsoir- with a credit card at the check-out and I had attached a copy of the', '…","user_reviewdate":"Aug. 2018","user_staydate":" May 2018","att_id":4450,"user_id":14}
