{"id":2570,"user_name":"MikeBCalgary","user_profile":"https://www.tripadvisor.ca/Profile/MikeBCalgary","user_rating":3,"user_review":"Beautiful local B & B without the second B This place is only a few Kms from Perce and is an ideal place to spend a bit of time with family and friends. The Auberge was transformed from a family home once belonging to the Mabe family. It has a few cottages as well as rooms in the main building with shared bathrooms. Only', '…","user_reviewdate":"Sep. 2016","user_staydate":" August 2016","att_id":1872,"user_id":68}
{"id":2371,"user_name":"Catherine M","user_profile":"https://www.tripadvisor.ca/Profile/catherinemL9604CC","user_rating":5,"user_review":"Wonderful B+B and Farm! I really wanted to stay on a farm with sheep, and this was it! The family was sooo charming, Annie even took my 24 year old daughter into the woods to pick chanterelle mushrooms. Lots of different animals to see. Very friendly family. Thank you!!!","user_reviewdate":"Aug. 2015","user_staydate":" August 2015","att_id":1738,"user_id":23}
{"id":5888,"user_name":"bigman66544","user_profile":"https://www.tripadvisor.ca/Profile/bigman66544","user_rating":4,"user_review":"Large property for such a small island ! It was the first time that my wife and I had ever visited Isle-aux-Coudres.  What a beautiful place and the people are incredibly friendly.  It was not to be a surprise that such a small island would B&B type accommodations but we were more than surprised when we came upon this', '…","user_reviewdate":"Jul. 2016","user_staydate":" July 2016","att_id":4318,"user_id":13}
{"id":2355,"user_name":"ygg264","user_profile":"https://www.tripadvisor.ca/Profile/ygg264","user_rating":5,"user_review":"10/10, nothing to improve! This is the best place in which Ive stayed during my 2 and half weeks around Quebec. I wouldnt change a thing!Le meilleur hebergement que je trouve pendand mon voyage de deux semaines et demi sur le Quebec!","user_reviewdate":"Oct. 2018","user_staydate":" September 2018","att_id":1725,"user_id":40}
{"id":2535,"user_name":"Ann622","user_profile":"https://www.tripadvisor.ca/Profile/Ann622","user_rating":3,"user_review":"An option for an overnight stay; good views We had been driving a while, it was late, driver needed to stop and so we came upon this motel.  Not thrilled with it's dated exterior and interior appearance but there were many vehicles in the parking lot, it was clean, we were only staying one night and it was inexpensive. \", '…","user_reviewdate":"Oct. 2017","user_staydate":" September 2017","att_id":1848,"user_id":80}
{"id":5693,"user_name":"scooper47","user_profile":"https://www.tripadvisor.ca/Profile/scooper47","user_rating":4,"user_review":"Nice Stay in a Big Room I liked this little town nestled in the mountains on the coast, and the manager was terrific. The parking lot is a lawn, which I found very restful after a long day. The room is very big for this type of motel with an excellent bed. The bathroom was not as good: no counter space', '…","user_reviewdate":"Aug. 2016","user_staydate":" June 2016","att_id":4191,"user_id":11}
{"id":5823,"user_name":"Mccleave N","user_profile":"https://www.tripadvisor.ca/Profile/mccleaven","user_rating":4,"user_review":"Was OK The first impression of this hotel as I drove by was  uh !! I was wrong yes it is dated and needs  work but the rooms were clean , staff were friendly and the food was good  . It was in a good location for me and not a bad place for a couple of nights.","user_reviewdate":"Oct. 2013","user_staydate":" October 2013","att_id":4278,"user_id":108}
{"id":830,"user_name":"sally2u","user_profile":"https://www.tripadvisor.ca/Profile/sally2u","user_rating":5,"user_review":"If you love cheese you have to stop here. I LOVE this place, I have been to the location in Spring Bay a few time and so happy they have a second location in Gore Bay that I believe is open year around. They have so many wonderful cheeses that can't be found any place else on Manitoulin Island, Not sure if you will like\", '…","user_reviewdate":"Nov. 2017","user_staydate":" November 2017","att_id":613,"user_id":31}
{"id":1445,"user_name":"scoobasteve","user_profile":"https://www.tripadvisor.ca/Profile/scoobasteve","user_rating":4,"user_review":"Clean, Affordable, Great Location Just got back from a recent stay at Kora Cottages,  The location was great, very short walk to the beach. Rooms were clean and well kept. The grounds were well maintained as well.   Would Definitely stay again.","user_reviewdate":"Jun. 2010","user_staydate":" May 2010","att_id":1040,"user_id":52}
{"id":6043,"user_name":"Kawartha Ron","user_profile":"https://www.tripadvisor.ca/Profile/KawarthaRon","user_rating":4,"user_review":"Well Satisfied Four of us came in by snowmobile from Ontario..................Friendly Reception....Clean rooms Reasonable rates.....A Finer Dining Resturant is on site....Which was well appreciated for the value and variety of good food...Overall a Very Pleasant Stay....  Tres  Bon","user_reviewdate":"Feb. 2016","user_staydate":" February 2016","att_id":4409,"user_id":104}
{"id":1210,"user_name":"twoinmaine","user_profile":"https://www.tripadvisor.ca/Profile/twoinmaine","user_rating":3,"user_review":"Basic Lodging on North Side of Gros Morne Mrs. TwoInMaine loves the beach at Shallow Bay - the warm water, long sand beach, dunes, gentle lapping waves. The J&J B&B is two miles from the beach in the town of Cow Head. Shallow Bay Motel owns every lodging in town, and this a good one-night or two-night stay location. The', '…","user_reviewdate":"Feb. 2019","user_staydate":" August 2018","att_id":873,"user_id":0}
{"id":4933,"user_name":"Lorne F","user_profile":"https://www.tripadvisor.ca/Profile/lornef77","user_rating":4,"user_review":"What one would expect for a work crew Decent older motel. Clean rooms. Clean, comfortable beds. Also offers kitchenettes. Fast strong wifi and good sized tvs.  Carpets a little dirty as expected from high traffic of work crews.  Did not get a lot off noise from outside or other rooms and room stayed dark so decent', '…","user_reviewdate":"Aug. 2018","user_staydate":" August 2018","att_id":3666,"user_id":97}
{"id":2021,"user_name":"Emmesey D","user_profile":"https://www.tripadvisor.ca/Profile/EmmeseyD","user_rating":3,"user_review":"OK place to sleep We picked this motel one summer day that we decided at 7 P.M. to engage in a 6-hour drive to Lac Saint Jean area. As midnight approached, we surfed on Safari and called a hotel that had no vacancy and suggested to try Motel Princesse.  With such a name, we doubted it would be', '…","user_reviewdate":"Jan. 2015","user_staydate":" July 2014","att_id":1481,"user_id":27}
{"id":4034,"user_name":"A TripAdvisor Member","user_profile":"https://www.tripadvisor.caundefined","user_rating":5,"user_review":"Excellent stay Shrey (I hope I remembered the correct spelling of the name) was helpful at check-in and answered all of my questions. When I asked if large groups were staying and was there a possibility of a room away from large groups as I was taking a course and anticipated homework, Shrey', '…","user_reviewdate":"Mar. 22","user_staydate":" March 2019","att_id":2979,"user_id":69}
{"id":4125,"user_name":"Barry G","user_profile":"https://www.tripadvisor.ca/Profile/219barryg","user_rating":5,"user_review":"It never fails to impress. This is our 4 th visit in the past 5 years. This year we returned with 8 couples all impressed with this jewel of an Ontario resort.  Food staff and accommodations are all Woking together to supply wonderful memories.","user_reviewdate":"Jan. 2019","user_staydate":" January 2019","att_id":3068,"user_id":46}
{"id":4185,"user_name":"Nick R","user_profile":"https://www.tripadvisor.ca/Profile/nickrH5240FW","user_rating":5,"user_review":"A wonderful weekend stay to celebrate Valentine's. We couldn't have ask for more. This is a classic and beautiful Century Home. We had some delicious breakfasts prepared for us. The innkeepers were friendly and helpful. We also booked the Afternoon Tea (a must) which was very good. My wife and I really enjoyed our stay and hope\", '…","user_reviewdate":"Feb. 2019","user_staydate":" February 2019","att_id":3114,"user_id":17}
{"id":845,"user_name":"TLC05172010","user_profile":"https://www.tripadvisor.ca/Profile/TLC05172010","user_rating":1,"user_review":"Awful We booked the cabin for a family wedding near by. Rustic is to nice a word. We stayed in Cabin 7 for 2 nights it is very run down the stairs from the back deck are unsafe and should not be used a heavy person or more than 1 would probably go through them. There is a spot in the', '…","user_reviewdate":"Aug. 2018","user_staydate":" August 2018","att_id":623,"user_id":95}
{"id":2745,"user_name":"Stephen H","user_profile":"https://www.tripadvisor.ca/Profile/103stephenh","user_rating":5,"user_review":"Excellent Value THE best value for a room I have seen in my 5 years and 15k+ travels of Quebec. Super clean,large,and very quiet and private for being just a couple minutes walk from all amenities. Check in was quick and easy even though I speak NO french,VERY friendly,helpfull,and even a', '…","user_reviewdate":"Sep. 2014","user_staydate":" September 2014","att_id":2008,"user_id":109}
{"id":5796,"user_name":"_maureen_morin","user_profile":"https://www.tripadvisor.ca/Profile/_maureen_morin","user_rating":5,"user_review":"You'll be treated like a family friend In July of 2015 My husband, our daughter, and I spent a week there. From the moment Majorie welcomed us to her lovely, spotless home until the day we left, she took care of all our needs. Breakfasts were spectacular and more than set us up for the day. She had a small', '…","user_reviewdate":"Jun. 2016","user_staydate":" July 2015","att_id":4263,"user_id":81}
{"id":4321,"user_name":"Fguptill","user_profile":"https://www.tripadvisor.ca/Profile/Fguptill","user_rating":5,"user_review":"Super clean, great food, low price We were warmly received by the couple who manage this B&B.  The room and common spaces were extraordinarily clean and tidy.  The breakfast was generous, delicious, high quality, and beautifully presented.  Price very reasonable. Free wifi and breakfast included.","user_reviewdate":"Jun. 2016","user_staydate":" June 2016","att_id":3217,"user_id":6}
{"id":3535,"user_name":"SORF01","user_profile":"https://www.tripadvisor.ca/Profile/SORF01","user_rating":5,"user_review":"Highly recommended - fantastic welcome & superb breakfasts We stayed here for 2 nights in August and had a fantastic stay.  There are 3 rooms in the gite to choose from, with two sharing one bathroom and the other (Rose des Vents) having its own bathroom.  Rose des Vents also has its own terrace with a nice view.  All the bedrooms are', '…","user_reviewdate":"Sep. 2016","user_staydate":" August 2016","att_id":2544,"user_id":103}
{"id":6008,"user_name":"DubStub","user_profile":"https://www.tripadvisor.ca/Profile/DubStub","user_rating":3,"user_review":"Lounge has a great steak special  I haven’t stayed in any of the rooms at the Adobe Inn but I did have a great steak dinner there. Friday’s are their steak special and for a great price you get delicious food. Steak, potatoe side, salad and toast. For $11.00. That can’t be beat and the food tasted great. I would', '…","user_reviewdate":"Jan. 2018","user_staydate":" January 2018","att_id":4384,"user_id":106}
{"id":3080,"user_name":"mayasami2018","user_profile":"https://www.tripadvisor.ca/Profile/mayasami2018","user_rating":5,"user_review":"it's a great place! We really enjoed our stay in Morning Glory the room was clean and cofmfortable,  the breakfast was very tasty  and it was a pleasure meeting with the hostess Betty. the locaiton was also good, in the quite wesetern side of Kelowna","user_reviewdate":"Aug. 2018","user_staydate":" June 2018","att_id":2251,"user_id":41}
{"id":2740,"user_name":"bvlynch","user_profile":"https://www.tripadvisor.ca/Profile/bvlynch","user_rating":4,"user_review":"Very nice apartment and good location to city - No lifts be aware I was lucky and due to a cancellation got apartment 9 on the Third floor . The apartment was huge especially as it was just for me . The bed was comfortable , they had a portable AC unit that was noisy but did its job keeping the room cool . Its quite a hike upstairs with a', '…","user_reviewdate":"Jul. 2017","user_staydate":" July 2017","att_id":2004,"user_id":75}
{"id":3345,"user_name":"Ole E","user_profile":"https://www.tripadvisor.ca/Profile/OleE_11","user_rating":5,"user_review":"Exellent B&B It is a pleasure to rate Willows Inn. My wife and I stayed there four nights during our two weeks in BC. We booked in April using 'Canadian bed and breakfast'. Keith and Pauline are wonderful hosts. Were offered a wellcome-glass of wine. Breakfast is exellent. The view from our\", '…","user_reviewdate":"Aug. 2011","user_staydate":" August 2011","att_id":2427,"user_id":88}
{"id":4898,"user_name":"gsgurd","user_profile":"https://www.tripadvisor.ca/Profile/gsgurd","user_rating":4,"user_review":"Quiet Fall visit to a beautiful B&B Stayed at the B&B on a Fall weekend.  It was even better than I expected. Warm hosts, comfortable room. Everything very clean and nicely decorated. Two friendly dogs.  To add to everything the B&B sits in a lovely wooded area off a quiet country road.  It was ten minutes south', '…","user_reviewdate":"Oct. 2016","user_staydate":" October 2016","att_id":3638,"user_id":110}
{"id":5393,"user_name":"Christine C","user_profile":"https://www.tripadvisor.ca/Profile/christinecU5915GD","user_rating":5,"user_review":"Amazing Island Hospitality! My husband and I stayed here for three nights total during our trip to Haida Gwaii and we feel like it is a really under-rated motel! I would highly recommend staying here if you find yourself in Sandspit.   Friendly: Judy was always warm and welcoming, ready to answer any', '…","user_reviewdate":"Aug. 2018","user_staydate":" August 2018","att_id":3989,"user_id":9}
{"id":2705,"user_name":"PatR359","user_profile":"https://www.tripadvisor.ca/Profile/PatR359","user_rating":3,"user_review":"Average place to stay if you need to stop for the night. After driving well into the night....needed to get off the road.  Stopped into this place...and the owner was just closing up the store.  (10 PM)  He was accommodating, asked for a room and price. $115 taxes included.  Got the room...and was surprised....it was a large room....2', '…","user_reviewdate":"Aug. 2014","user_staydate":" August 2014","att_id":1974,"user_id":26}
{"id":4748,"user_name":"franee0409","user_profile":"https://www.tripadvisor.ca/Profile/franee0409","user_rating":5,"user_review":"Fine Wine, Dine and Rise and Shine What a wonderful stop in our journey around the Gaspe Peninsula. This B & B right off route 132 offers lovely rooms, a wonderful dinner menu and an ample satisfying breakfast. We enjoyed speaking with the host and her chef husband and they couldn't have been nicer or more\", '…","user_reviewdate":"Jul. 2014","user_staydate":" July 2014","att_id":3526,"user_id":102}
