{"id":2735,"user_name":"melaniearden","user_profile":"https://www.tripadvisor.ca/Profile/melaniearden","user_rating":4,"user_review":"Good for overnight stop This is a traveler's' motel and is a good price for a stopover. Breakfast was ok and the room was clean and the beds comfortable. The location is easy to find just off the highway. The staff were very nice too.","user_reviewdate":"Dec. 2016","user_staydate":" November 2016","att_id":1999,"user_id":61}
{"id":2980,"user_name":"duncanfly","user_profile":"https://www.tripadvisor.ca/Profile/duncanfly","user_rating":3,"user_review":"If you need a place to stay on the Gaspe, this should suit your basic needs. We rolled into Gaspe a little tired and worn-out from our drive.  This hotel offers most of the basic ammentties but we noticed there were other places to stay in this little town.  The cost was resonable but if you wanted a real experience, thier were places located closer to', '…","user_reviewdate":"Oct. 2009","user_staydate":" July 2009","att_id":2181,"user_id":85}
{"id":5893,"user_name":"Melissa V","user_profile":"https://www.tripadvisor.ca/Profile/155melissav","user_rating":5,"user_review":"Cozy Country Inn My husband and I stayed here 3 nights while visiting Ile D'orléans and Old Québec. Our original hotel reservation with a different hotel was lost and we were on the island at 11pm with nowhere to stay. We called the Auberge and the lovely hostess provided us a room at that late\", '…","user_reviewdate":"Jun. 2017","user_staydate":" June 2017","att_id":4321,"user_id":66}
{"id":2580,"user_name":"carm61","user_profile":"https://www.tripadvisor.ca/Profile/carm61","user_rating":4,"user_review":"Very clean, nice hostess. Small room, great for a 1 or 2 night night stay. They also have bigger rooms with kitchenettes. The best thing is it's right in the middle of everything. Just park your car and walk everywhere. You can also take a bus tour of all of Gaspesie right across the street. Whale\", '…","user_reviewdate":"Aug. 2018","user_staydate":" August 2018","att_id":1882,"user_id":29}
{"id":3180,"user_name":"LoveToTravel1982282","user_profile":"https://www.tripadvisor.ca/Profile/LoveToTravel1982282","user_rating":5,"user_review":"Amazing hosts We stayed here two nights after arriving by ferry from Prince Rupert the day before. Kelley welcomed us late evening around midnight.  It was a fantastic stay.  They have two super clean and beautiful rooms with one bathroom each. In the morning Kelley prepares a very delicious', '…","user_reviewdate":"Aug. 2018","user_staydate":" August 2018","att_id":2327,"user_id":90}
{"id":2585,"user_name":"Shyla A","user_profile":"https://www.tripadvisor.ca/Profile/955shylaa","user_rating":4,"user_review":"2 night stay What a great little place! Had a kitchenette which was awesome for making breakfast instead of going out.  It was clean and had a great view of the water, plus there is an actual rock with seals on it.  You just walk down a little path and overlook the cliff and boom! Seals!  We', '…","user_reviewdate":"Jul. 2017","user_staydate":" July 2017","att_id":1885,"user_id":77}
{"id":3523,"user_name":"Urseen","user_profile":"https://www.tripadvisor.ca/Profile/Urseen","user_rating":5,"user_review":"One of our best B&B's in Quebec If you plan a trip to the Mauricier National Park, go to this B&B!! It's situated about 5Km away from the park entrance and 2min away from the river, where you can take a swimm, play beach volley, BBQ and and and. Th B&B offers different games, that you can use for free\", '…","user_reviewdate":"Jul. 2013","user_staydate":" July 2013","att_id":2539,"user_id":35}
{"id":2515,"user_name":"Fifi01","user_profile":"https://www.tripadvisor.ca/Profile/Fifi01","user_rating":4,"user_review":"A Comfortable Stay We stayed two nights as part of our rockies tour. The rooms are clean and comfortable and we had a great view out onto the river. There is a deck down by the river which is quite nice to take a bottle of wine and a book and watch the river go past in the evening. Breakfasts were', '…","user_reviewdate":"Aug. 2007","user_staydate":" August 2007","att_id":1830,"user_id":53}
{"id":2588,"user_name":"Leigh C","user_profile":"https://www.tripadvisor.ca/Profile/WileyFrench","user_rating":5,"user_review":"What a gem! We stayed two nights in this lovely spot.  They were about two days from closing for the winter, so there was no breakfast offered, but that was fine.  The room was just lovely, and the location was great.  The patio had great chairs, there were sliding/rockers and other seating', '…","user_reviewdate":"Oct. 2018","user_staydate":" October 2018","att_id":1886,"user_id":105}
{"id":480,"user_name":"GB1209","user_profile":"https://www.tripadvisor.ca/Profile/GB1209","user_rating":2,"user_review":"Unit 238-4 two Families Unit 238-4 is very dated and needs a  upgrade badly. Beds were old, master bedroom door frame was broken, kitchen chair broken, bathròom tiles broken and held down with tape, kitchen utensils were old and hardly useable. The couch in the living room was so old and broken down', '…","user_reviewdate":"Feb. 2018","user_staydate":" February 2018","att_id":347,"user_id":43}
{"id":2578,"user_name":"DevPS","user_profile":"https://www.tripadvisor.ca/Profile/DevPS","user_rating":2,"user_review":"Not as expected Though it looks good from the outside, the inside definitely needs improvement in many ways. Old building. We were given the room on the side of the bathroom and we did not like it at all. Noisy and creaky floor, door does not close properly, cannot be locked when you go out', '…","user_reviewdate":"Aug. 2014","user_staydate":" August 2014","att_id":1880,"user_id":39}
{"id":2945,"user_name":"Angelaizzo89","user_profile":"https://www.tripadvisor.ca/Profile/Angelaizzo89","user_rating":5,"user_review":"Loved this B&B We stayed two nights, Danielle and Laurent were so nice they made us feel at home, made delicious breakfast, gave us great advice on things to do and places to eat. We had great conversations in the morning.  Room was large and comfy. Best B&B we stayed at during our trip!  ', '…","user_reviewdate":"Aug. 2018","user_staydate":" August 2018","att_id":2160,"user_id":15}
{"id":4543,"user_name":"Jason Fredericton","user_profile":"https://www.tripadvisor.ca/Profile/PhotogJason","user_rating":5,"user_review":"A wonderful bed and breakfast I spent two nights here during Canada Day weekend because I was in New Richmond (26 km away) photographing one of the Canadian Rally Championship races.  I was lucky enough to find this spot at the last minute and after staying here, with clean rooms, a wonderfully delicious', '…","user_reviewdate":"Jul. 2016","user_staydate":" July 2016","att_id":3382,"user_id":107}
{"id":5037,"user_name":"Edy D","user_profile":"https://www.tripadvisor.ca/Profile/371edyd","user_rating":5,"user_review":"Definitely a place to stay The room was extremely clean, lots of amenities, very hospitable owners. Great equipment rental. We spent the day on Lac Sacacomie. Severine and Philippe are wonderful and very helpful. There is a continental breakfast, onsite bbq facilities, in-room fridge, so making our own', '…","user_reviewdate":"Aug. 2018","user_staydate":" July 2018","att_id":3736,"user_id":99}
{"id":4399,"user_name":"Roadrunner666","user_profile":"https://www.tripadvisor.ca/Profile/Roadrunner666","user_rating":4,"user_review":"Nice B/B downtown LaTuque Very nice B/B located in the downtown area of LaTuque.  Very clean, absolutely spotless rooms and bathroom.  The host, Syvie and Sylvius are very frienfly locals.  We were immediately at ease and they made sure our stay was confortable and pleasurable.  Breakfast next morning', '…","user_reviewdate":"Aug. 2013","user_staydate":" August 2013","att_id":3274,"user_id":93}
{"id":4742,"user_name":"Marjorie F","user_profile":"https://www.tripadvisor.ca/Profile/370marjorief","user_rating":5,"user_review":"My experience at the Gite I had a great time, the room was beautiful, the breakfast was also great! The service and the staff was fantastic. Food wise I highly recommend the restaurant they own just 10 minutes away the food is amazing and the restaurant is very charming! I will definitely go back ","user_reviewdate":"Dec. 2014","user_staydate":" September 2014","att_id":3521,"user_id":57}
{"id":5867,"user_name":"DPM","user_profile":"https://www.tripadvisor.ca/Profile/DenaM294","user_rating":5,"user_review":"Clean room and charming owner. Our room was very clean and modern.  The owner, Claude was very charming and accommodating.  His English was limited but we managed to communicate well  – plus Our French was very limited as well.  The price was good and the breakfast was very nice.","user_reviewdate":"Jul. 2014","user_staydate":" June 2014","att_id":4305,"user_id":92}
{"id":265,"user_name":"goldsackdenise","user_profile":"https://www.tripadvisor.ca/Profile/goldsackdenise","user_rating":3,"user_review":"Good value We had a lot of fun at this little motel.  They are in the process of fixing it up.  Staff is so nice.  It also has guest laundry facility which I appreciated.  Its not fancy, but it is a good value.  The rooms are clean and our unit had a little kitchen area as well.  My only', '…","user_reviewdate":"Aug. 2016","user_staydate":" July 2016","att_id":202,"user_id":12}
{"id":1301,"user_name":"petite_nemo","user_profile":"https://www.tripadvisor.ca/Profile/Maude_29","user_rating":4,"user_review":"Good value, clean and staff very accommodating  Great value for the price. Our room was very clean, quite large, it wasn't too noisy, and we really appreciated the mini kitchen facilities. We also found the staff to be very accommodating as we needed a place to keep some things frozen and they've offered to keep it for us in\", '…","user_reviewdate":"Oct. 2018","user_staydate":" September 2018","att_id":946,"user_id":37}
{"id":4838,"user_name":"Titevie","user_profile":"https://www.tripadvisor.ca/Profile/Titevie","user_rating":5,"user_review":"Makes you feel like home! Went there last weekend for 2 nights. What a nice find! All rooms are clean and comfy, with private washrooms and all the commodities you wish for! Very well decorated too by the owner, who is also a painter. She proudly will show you her works, without making you uncomfortable', '…","user_reviewdate":"May 2017","user_staydate":" May 2017","att_id":3590,"user_id":2}
{"id":4909,"user_name":"lac38","user_profile":"https://www.tripadvisor.ca/Profile/lac38","user_rating":5,"user_review":"Lovely place! This was our second visit to Gite chez Lucie.  She is very warm and friendly, she was very happy to see us return.  The house is beautifully decorated, as are the rooms, the place is spotless and we had our own bathroom.  The breakfast is continental, but offers plenty of food', '…","user_reviewdate":"Oct. 2016","user_staydate":" August 2016","att_id":3648,"user_id":22}
{"id":5448,"user_name":"TravelcrazyAntwerp","user_profile":"https://www.tripadvisor.ca/Profile/TravelcrazyAntwerp","user_rating":4,"user_review":"Rustic hotel, very good dinner and breakfast My husband and I stayed for 1 night in this hotel. The hotel is located at the edge of the village of Sainte-Rose-du-Nord, next to the cemetary. It is very quiet as a result.  The rooms are reached by a stair outside at the side of the hotel. The decor of the room is rustic. We', '…","user_reviewdate":"Nov. 2015","user_staydate":" September 2015","att_id":4024,"user_id":83}
{"id":3509,"user_name":"Lala C","user_profile":"https://www.tripadvisor.ca/Profile/30lalac","user_rating":5,"user_review":"Superb Amazing.... Beautifull house on the lake!! Very clean &  bright. Delicious breakfast prepared with local products (crepes are to die for).Jeanne and Christian sure know how to make you feel at home  still with a  detailed attention in a  very quiet and cozy place, they also', '…","user_reviewdate":"Aug. 2016","user_staydate":" August 2016","att_id":2529,"user_id":50}
{"id":1980,"user_name":"Joan G","user_profile":"https://www.tripadvisor.ca/Profile/6JoanG","user_rating":1,"user_review":"Not Good! Did not enjoy this place!  Had to move cottages 3 times within 2 days!   What is shown on internet is the owners cottage!  Not what you get!  Also water was unable to swim in and would of been nice to told prior to arrival!  We left early!  Nicole was great but place no good! ', '…","user_reviewdate":"Jul. 2012","user_staydate":" August 2011","att_id":1459,"user_id":36}
{"id":4165,"user_name":"Adam B","user_profile":"https://www.tripadvisor.ca/Profile/adambC6534HT","user_rating":5,"user_review":"Amazing place! Jut a wonderful place. As soon as we arrived we felt at home. The staff are lovely, warm and friendly. The food is home cooked and delicious. The scenery is breathtaking. My son (2 y.o.) had a fantastic time. Recommend thoroughly.","user_reviewdate":"Oct. 2018","user_staydate":" October 2018","att_id":3097,"user_id":60}
{"id":5858,"user_name":"spidergirlotburg","user_profile":"https://www.tripadvisor.ca/Profile/spidergirlotburg","user_rating":4,"user_review":"Comfortable but someone messed up the sink I was in room 18.  I liked everything about the hotel, the bed, the internet and the friendly and helpful staff. The room was spacious with an easy chair where I watched netflix on my computer.  I also took a nice warm shower.   But someone got too aggressive with cleaning the', '…","user_reviewdate":"Aug. 2014","user_staydate":" August 2014","att_id":4299,"user_id":55}
{"id":1275,"user_name":"Amandine V","user_profile":"https://www.tripadvisor.ca/Profile/758amandinev","user_rating":5,"user_review":"Perfect !  It was a big pleasure to sleep one night in the beautiful house of Carole. It is very clean and well equipment, there is everything you need. It is also very well decorated !  The view on the Ontario lake is just wonderful and you are only 10 mn by car to the center of Kingston.', '…","user_reviewdate":"Sep. 2016","user_staydate":" September 2016","att_id":925,"user_id":64}
{"id":5728,"user_name":"Michel B","user_profile":"https://www.tripadvisor.ca/Profile/313leep","user_rating":4,"user_review":"You have what you are paying for We rented this place at the last minute. We wanted to go at Centre de plein air. The room was ok. Nothing fancy, but it was clean. The view was incredible. The action on the site was also fun, lots of people. The breakfast was very nice. Lots of choices and the food was good. I', '…","user_reviewdate":"Jul. 2017","user_staydate":" July 2017","att_id":4211,"user_id":96}
{"id":955,"user_name":"ScentOfFlowers","user_profile":"https://www.tripadvisor.ca/Profile/ScentOfFlowers","user_rating":5,"user_review":"Hanging out We had originally booked for two days, but due to a friend falling ill, we were luckily able to add on two extra days. My grandparents moved to Vesuvius in 55 and I spent all of my summers there. This was a wonderful 4 days of reminiscing. After the initial meet and greet with', '…","user_reviewdate":"Jun. 2018","user_staydate":" May 2018","att_id":694,"user_id":19}
{"id":2020,"user_name":"Joanne C","user_profile":"https://www.tripadvisor.ca/Profile/C9443SNjoannec","user_rating":5,"user_review":"Comfortable and quiet I stayed at this B&B for one night as I was visiting a relative in lac St-Jean. The house is beautiful and impeccably kept. My room was comfortable and quiet. The bed was nice and soft with lots of pillows. They have two bathrooms. One with a nice bath tub and one with a shower.', '…","user_reviewdate":"Jul. 2016","user_staydate":" July 2016","att_id":1480,"user_id":89}
